
[
    {
        "id":1,
        "title":"Star Wars: Episode VII The Force Awakens",
        "year":2015,
        "cast":[
            "Harrison Ford",
            "Mark Hamill",
            "Carrie Fisher",
            "Adam Driver",
            "Daisy Ridley",
            "John Boyega",
            "Oscar Isaac",
            "Lupita Nyong'o",
            "Andy Serkis",
            "Domhnall Gleeson",
            "Anthony Daniels",
            "Peter Mayhew",
            "Max von Sydow"
        ],
        "genres":[
            "space",
            "epic",
            "action",
            "popular"
        ],
        "summary":"Thirty years after the Battle of Endor, a new threat has risen in the form of the First Order and the villainous Kylo Ren. Meanwhile, Rey, a young scavenger, discovers powers that will change her life -- and possibly save the galaxy.",
        "imageName":"picture1"
    },
    {
        "id":2,
        "title":"Arcane",
        "year":2021,
        "cast":[
            "Hailee Steinfeld",
            "Kevin Alejandro",
            "Jason Spisak"
        ],
        "genres":[
            "animation",
            "action",
            "adventure"
        ],
        "summary":"Set in utopian Piltover and the oppressed underground of Zaun, the story follows the origins of two iconic League champions-and the power that will tear them apart.",
        "imageName":"Arcane"
    },
    {
        "id":3,
        "title":"Morbius",
        "year":2022,
        "cast":[
            "Jared Leto",
            "Matt Smith",
            "Adria Arjona",
            "Jared Harris",
            "Al Madrigal",
            "Tyrese Gibson"
        ],
        "genres":[
            "superhero",
            "action"
        ],
        "summary":"Biochemist Michael Morbius tries to cure himself of a rare blood disease, but he inadvertently infects himself with a form of vampirism instead.",
        "imageName":"picture3"
    },
    {
        "id":4,
        "title":"The Batman",
        "year":2022,
        "cast":[
            "Robert Pattinson",
            "Zoë Kravitz",
            "Jeffrey Wright"
        ],
        "genres":[
            "superhero",
            "action"
        ],
        "summary":"When a sadistic serial killer begins murdering key political figures in Gotham, Batman is forced to investigate the city's hidden corruption and question his family's involvement.",
        "imageName":"picture4"
    },
    {
        "id":5,
        "title":"The Boys",
        "year":2019,
        "cast":[
            "Karl Urban",
            "Jack Quaid",
            "Antony Starr",
            "Erin Moriarty",
            "Dominique McElligott",
            "Jessie T. Usher",
            "Laz Alonso",
            "Chace Crawford",
            "Tomer Capone",
            "Karen Fukuhara",
            "Nathan Mitchell",
            "Elisabeth Shue",
            "Colby Minifie",
            "Aya Cash",
            "Claudia Doumit",
            "Jensen Ackles"
        ],
        "genres":[
            "superhero",
            "action",
            "black comedy"
        ],
        "summary":"The Boys is set in a universe where superpowered individuals, called Supes, are recognized as heroes by the general public and work for a powerful corporation known as Vought International that markets and monetizes them. Outside their heroic personas, most are arrogant, selfish, and corrupt. The series primarily focuses on two groups: the Seven, Vought's premier superhero team, and the Boys, vigilantes looking to bring down Vought and its corrupt superheroes. The Boys are led by Billy Butcher, who despises all Supes, and the Seven are led by the egotistical and unstable Homelander. At the start of the series, the Boys are joined by Hughie Campbell after a superhero accidentally kills his girlfriend, and the Seven are joined by Annie January, a young and hopeful heroine forced to face the truth about those she admires. Other members of the Seven include the disillusioned Queen Maeve, the drug-addicted A-Train, the insecure Deep, the mysterious Black Noir, and the white supremacist Stormfront. The Boys are rounded out by tactical planner Mother's Milk, weapons specialist Frenchie, and superpowered test subject Kimiko. Overseeing the Seven is Vought executive Madelyn Stillwell, who is later succeeded by publicist Ashley Barrett. Other superpowered individuals include Victoria Newman, a congresswoman who publicly opposes Vought while secretly assisting the corporation, and Soldier Boy, Vought's original premier superhero.",
        "imageName":"picture5"
    },
    {
        "id":6,
        "title":"Project Power",
        "year":2022,
        "cast":[
            "Jamie Foxx",
            "Joseph Gordon-Levitt",
            "Dominique Fishback"
        ],
        "genres":[
            "action",
            "crime",
            "science fiction"
        ],
        "summary":"When a pill that gives its users unpredictable superpowers for five minutes hits the streets of New Orleans, a teenage dealer and a local cop must team with an ex-soldier to take down the group responsible for its creation.",
        "imageName":"projectpower"
    },
    {
        "id":7,
        "title":"Marriage Story",
        "year":2019,
        "cast":[
            "Adam Driver",
            "Scarlett Johansson",
            "Julia Greer"
        ],
        "genres":[
            "drama",
            "romance"
        ],
        "summary":"Noah Baumbach's incisive and compassionate look at a marriage breaking up and a family staying together.",
        "imageName":"marriagestory"
    },
    {
        "id":8,
        "title":"Klaus",
        "year":2019,
        "cast":[
            "Jason Schwartzman(voice)",
            "J.K. Simmons(voice)",
            "Rashida Jones(voice)"
        ],
        "genres":[
            "animation",
            "adventure",
            "comedy"
        ],
        "summary":"A simple act of kindness always sparks another, even in a frozen, faraway place. When Smeerensburg's new postman, Jesper, befriends toymaker Klaus, their gifts melt an age-old feud and deliver a sleigh full of holiday traditions.",
        "imageName":"klaus"
    },
    {
        "id":9,
        "title":"The Adam Project",
        "year":2022,
        "cast":[
            "Ryan Reynolds",
            "Walker Scobell",
            "Mark Ruffalo"
        ],
        "genres":[
            "action",
            "adventure",
            "comedy"
        ],
        "summary":"After accidentally crash-landing in 2022, time-traveling fighter pilot Adam Reed teams up with his 12-year-old self for a mission to save the future.",
        "imageName":"TheAdamProject"
    },
    {
        "id":10,
        "title":"BirdBox",
        "year":2018,
        "cast":[
            "Sandra Bullock",
            "Trevante Rhodes",
            "John Malkovich"
        ],
        "genres":[
            "action",
            "adventure",
            "comedy"
        ],
        "summary":"Five years after an ominous unseen presence drives most of society to suicide, a mother and her two children make a desperate bid to reach safety.",
        "imageName":"birdbox"
    },
    {
        "id":11,
        "title":"The Gray Man",
        "year":2022,
        "cast":[
            "Ryan Gosling",
            "Chris Evans",
            "Ana de Armas"
        ],
        "genres":[
            "action",
            "thriller"
        ],
        "summary":"When the CIA's most skilled operative-whose true identity is known to none-accidentally uncovers dark agency secrets, a psychopathic former colleague puts a bounty on his head, setting off a global manhunt by international assassins.",
        "imageName":"TheGrayMan"
    },
    {
        "id":12,
        "title":"The Perfect Date",
        "year":2019,
        "cast":[
            "Noah Centineo",
            "Laura Marano",
            "Odiseas Georgiadis"
        ],
        "genres":[
            "comedy",
            "romance"
        ],
        "summary":"To save up for college, Brooks Rattigan creates an app where anyone can pay him to play the perfect stand-in boyfriend for any occasion.",
        "imageName":"ThePerfectDate"
    }
]
