[
    {
        "id":1,
        "title":"Star Wars: Episode VII The Force Awakens",
        "year":2015,
        "cast":[
            "Harrison Ford",
            "Mark Hamill",
            "Carrie Fisher",
            "Adam Driver",
            "Daisy Ridley",
            "John Boyega",
            "Oscar Isaac",
            "Lupita Nyong'o",
            "Andy Serkis",
            "Domhnall Gleeson",
            "Anthony Daniels",
            "Peter Mayhew",
            "Max von Sydow"
        ],
        "genres":[
            "space",
            "epic",
            "action",
            "popular"
        ],
        "summary":"Thirty years after the Battle of Endor, a new threat has risen in the form of the First Order and the villainous Kylo Ren. Meanwhile, Rey, a young scavenger, discovers powers that will change her life -- and possibly save the galaxy.",
        "imageName":"picture2"
    },
    {
        "id":2,
        "title":"Red Notice",
        "year":2021,
        "cast":[
            "Dwayne Johnson",
            "Ryan Reynolds",
            "Gal Gadot",
            "Ritu Arya",
            "Chris Diamantopoulos"
        ],
        "genres":[
            "comedy",
            "action"
        ],
        "summary":"An Interpol-issued red notice is a global alert to hunt and capture the world’s most wanted. But when a daring heist brings together the FBI’s top profiler (Johnson) and two rival criminals (Gadot, Reynolds), there’s no telling what will happen.",
        "imageName":"picture2"
    },
    {
        "id":3,
        "title":"Morbius",
        "year":2022,
        "cast":[
            "Jared Leto",
            "Matt Smith",
            "Adria Arjona",
            "Jared Harris",
            "Al Madrigal",
            "Tyrese Gibson"
        ],
        "genres":[
            "superhero",
            "action"
        ],
        "summary":"Biochemist Michael Morbius tries to cure himself of a rare blood disease, but he inadvertently infects himself with a form of vampirism instead.",
        "imageName":"picture2"
    },
    {
        "id":4,
        "title":"The Batman",
        "year":2022,
        "cast":[
            "Robert Pattinson",
            "Zoë Kravitz",
            "Jeffrey Wright"
        ],
        "genres":[
            "superhero",
            "action"
        ],
        "summary":"When a sadistic serial killer begins murdering key political figures in Gotham, Batman is forced to investigate the city's hidden corruption and question his family's involvement.",
        "imageName":"picture2"
    },
    {
        "id":5,
        "title":"The Boys",
        "year":2019,
        "cast":[
            "Karl Urban",
            "Jack Quaid",
            "Antony Starr",
            "Erin Moriarty",
            "Dominique McElligott",
            "Jessie T. Usher",
            "Laz Alonso",
            "Chace Crawford",
            "Tomer Capone",
            "Karen Fukuhara",
            "Nathan Mitchell",
            "Elisabeth Shue",
            "Colby Minifie",
            "Aya Cash",
            "Claudia Doumit",
            "Jensen Ackles"
        ],
        "genres":[
            "superhero",
            "action",
            "black comedy"
        ],
        "summary":"The Boys is set in a universe where superpowered individuals, called Supes, are recognized as heroes by the general public and work for a powerful corporation known as Vought International that markets and monetizes them. Outside their heroic personas, most are arrogant, selfish, and corrupt. The series primarily focuses on two groups: the Seven, Vought's premier superhero team, and the Boys, vigilantes looking to bring down Vought and its corrupt superheroes. The Boys are led by Billy Butcher, who despises all Supes, and the Seven are led by the egotistical and unstable Homelander. At the start of the series, the Boys are joined by Hughie Campbell after a superhero accidentally kills his girlfriend, and the Seven are joined by Annie January, a young and hopeful heroine forced to face the truth about those she admires. Other members of the Seven include the disillusioned Queen Maeve, the drug-addicted A-Train, the insecure Deep, the mysterious Black Noir, and the white supremacist Stormfront. The Boys are rounded out by tactical planner Mother's Milk, weapons specialist Frenchie, and superpowered test subject Kimiko. Overseeing the Seven is Vought executive Madelyn Stillwell, who is later succeeded by publicist Ashley Barrett. Other superpowered individuals include Victoria Newman, a congresswoman who publicly opposes Vought while secretly assisting the corporation, and Soldier Boy, Vought's original premier superhero.",
        "imageName":"picture2"
    }
]
